; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 274256 1 2 4 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph0 - mode
	spectrograph3 - mode
	image1 - mode
	thermograph2 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star5 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Planet8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(supports instrument1 thermograph2)
	(supports instrument1 image1)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
)
(:goal (and
	(have_image Phenomenon6 image1)
	(have_image Planet7 image1)
	(have_image Planet8 thermograph0)
	(have_image Phenomenon9 image1)
	(have_image Star10 image1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 5
2. (turn_to satellite0 groundstation2 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation2)
   goals met: 0 of 5
3. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 0 of 5
4. (turn_to satellite0 planet8 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet8)
   goals met: 0 of 5
5. (take_image satellite0 planet8 instrument1 thermograph0)
   added: (have_image planet8 thermograph0)
   goals met: 1 of 5
6. (turn_to satellite0 planet7 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 planet7)
   goals met: 1 of 5
7. (take_image satellite0 planet7 instrument1 image1)
   added: (have_image planet7 image1)
   goals met: 2 of 5
8. (turn_to satellite0 phenomenon9 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 5
9. (take_image satellite0 phenomenon9 instrument1 image1)
   added: (have_image phenomenon9 image1)
   goals met: 3 of 5
10. (turn_to satellite0 phenomenon6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon6)
   goals met: 3 of 5
11. (take_image satellite0 phenomenon6 instrument1 image1)
   added: (have_image phenomenon6 image1)
   goals met: 4 of 5
12. (turn_to satellite0 star10 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 star10)
   goals met: 4 of 5
13. (take_image satellite0 star10 instrument1 image1)
   added: (have_image star10 image1)
   goals met: 5 of 5
